
# tap repositories and their packages

tap 'homebrew/core'

tap 'homebrew/cask'

tap 'pantsbuild/tap'

tap 'benbjohnson/litestream'
brew 'litestream'

tap 'boz/repo'

tap 'buildpacks/tap'
brew 'pack'

tap 'buo/cask-upgrade'

tap 'dashlane/tap'
brew 'dashlane-cli'

tap 'datadog/tap'
brew 'devkube'
brew 'docker-local-dev'
brew 'fabric-cli'
brew 'kubectl-analyse'
brew 'kubectl-iscale'
brew 'kubectl-multiexec'
brew 'kubectl-template'
brew 'latest-chart'
brew 'latest-datacenter-config'
brew 'latest-image'
brew 's22-checker'
brew 'sce'
brew 'to-prod'
brew 'to-staging'
brew 'trigger-ci'
brew 'vault'
cask 'atlas'
cask 'bzl'
cask 'computectl'
cask 'datadog-workspaces'
cask 'ddev'
cask 'ddr'
cask 'ddsign'
cask 'ddtool'
cask 'tctl-data-converter'
cask 'tctl-local-auth'
cask 'tctx'

tap 'derailed/k9s'
brew 'k9s'

tap 'github/gh'

tap 'goreleaser/tap'
brew 'goreleaser'

tap 'gromgit/fuse'
brew 'sshfs-mac'

tap 'hashicorp/tap'
brew 'terraform'

tap 'helm/tap'
brew 'chart-releaser'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'maxandersen/tap'

tap 'mike-engel/jwt-cli'
brew 'jwt-cli'

tap 'muesli/tap'
brew 'duf'

tap 'norwoodj/tap'
brew 'helm-docs'

#tap 'rcmdnk/file'
#brew 'brew-file'

tap 'stefanprodan/tap'
brew 'timoni'

tap 'tektoncd/tools'
brew 'tektoncd-cli'

tap 'thethingsnetwork/lorawan-stack'
brew 'ttn-lw-cli'

tap 'ubuntu/microk8s'
brew 'microk8s'

tap 'wata727/tflint'

tap 'weaveworks/tap'
brew 'eksctl'

tap 'withgraphite/tap'
brew 'graphite'

# Other Homebrew packages
brew 'abseil'
brew 'act'
brew 'adns'
brew 'adr-tools'
brew 'adwaita-icon-theme'
brew 'ansible'
brew 'ant'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argocd'
brew 'aria2'
brew 'aribb24'
brew 'asciidoctor'
brew 'assimp'
brew 'at-spi2-core'
brew 'autoconf'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'awscli@1'
brew 'awslogs'
brew 'azure-cli'
brew 'balena-cli'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bazelisk'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'berkeley-db@5'
brew 'bfg'
brew 'blueutil'
brew 'boost'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'certifi'
brew 'cffi'
brew 'cjson'
brew 'clusterctl'
brew 'cmake'
brew 'cmocka'
brew 'coreutils'
brew 'crane'
brew 'cryptography'
brew 'ctop'
brew 'curl'
brew 'cyme'
brew 'dav1d'
brew 'dbus'
brew 'delve'
brew 'dialog'
brew 'difftastic'
brew 'direnv'
brew 'dive'
brew 'docker'
brew 'docker-completion'
brew 'docker-credential-helper-ecr'
brew 'docutils'
brew 'double-conversion'
brew 'duktape'
brew 'entr'
brew 'etcd'
brew 'exiftool'
brew 'expat'
brew 'expect'
brew 'eza'
brew 'fdupes'
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'flac'
brew 'fontconfig'
brew 'foremost'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fswatch'
brew 'fx'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gdrive'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'gimme'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'git-secret'
brew 'git-secrets'
brew 'glances'
brew 'glib'
brew 'glow'
brew 'gmime'
brew 'gmp'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg'
brew 'gnuplot'
brew 'gnutls'
brew 'go'
brew 'go-jira'
brew 'gobject-introspection'
brew 'gotop'
brew 'gpgme'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'grpc'
brew 'grpcurl'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'gts'
brew 'guile'
brew 'gum'
brew 'harfbuzz'
brew 'helm'
brew 'helmfile'
brew 'hicolor-icon-theme'
brew 'highlight'
brew 'highway'
brew 'htop'
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'hugo'
brew 'hunspell'
brew 'hwloc'
brew 'hyperfine'
brew 'icu4c@76'
brew 'icu4c@77'
brew 'iftop'
brew 'imath'
brew 'influxdb-cli'
brew 'iperf'
brew 'isl'
brew 'jasper'
brew 'jemalloc'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'jsoncpp'
brew 'kind'
brew 'kops'
brew 'krb5'
brew 'krew'
brew 'kube-ps1'
brew 'kubebuilder'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubeseal'
brew 'kubespy'
brew 'kustomize'
brew 'lame'
brew 'lazydocker'
brew 'lazygit'
brew 'leptonica'
brew 'libapplewm'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcbor'
brew 'libcerf'
brew 'libclc'
brew 'libdeflate'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libfido2'
brew 'libfontenc'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libice'
brew 'libiconv'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'liblinear'
brew 'libmetalink'
brew 'libmicrohttpd'
brew 'libmng'
brew 'libmpc'
brew 'libnghttp2'
brew 'libogg'
brew 'libpng'
brew 'libpq'
brew 'libproxy'
brew 'libpthread-stubs'
brew 'librdkafka'
brew 'librist'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsm'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxfixes'
brew 'libxfont2'
brew 'libxi'
brew 'libxinerama'
brew 'libxkbcommon'
brew 'libxkbfile'
brew 'libxml2'
brew 'libxmu'
brew 'libxrandr'
brew 'libxrender'
brew 'libxt'
brew 'libxtst'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'llvm'
brew 'lmdb'
brew 'lpeg'
brew 'lsusb'
brew 'lua'
brew 'luajit'
brew 'luajit-openresty'
brew 'luarocks'
brew 'luv'
brew 'lxc'
brew 'lz4'
brew 'lzlib'
brew 'lzo'
brew 'm-cli'
brew 'm4'
brew 'macos-term-size'
brew 'make'
brew 'mas'
brew 'maven'
brew 'mbedtls'
brew 'md4c'
brew 'mercurial'
brew 'mesa'
brew 'mitmproxy'
brew 'mkcert'
brew 'mockery'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'msgpack'
brew 'mu'
brew 'mysql'
brew 'ncurses'
brew 'neomutt'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'node'
brew 'notmuch'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'numpy'
brew 'offlineimap'
brew 'oniguruma'
brew 'onnx'
brew 'opa'
brew 'openblas'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@11'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@3'
brew 'openvino'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pandoc'
brew 'pango'
brew 'parallel'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pipenv'
brew 'pixman'
brew 'pkgconf'
brew 'procs'
brew 'protobuf'
brew 'protobuf@21'
brew 'protobuf@29'
brew 'pstree'
brew 'pugixml'
brew 'py3cairo'
brew 'pycparser'
brew 'pyenv'
brew 'pygit2'
brew 'pygments'
brew 'pygobject3'
brew 'python@3.13'
brew 'qpdf'
brew 'qt'
brew 'qt@5'
brew 'rav1e'
brew 'rbenv'
brew 'rbspy'
brew 'rclone'
brew 're2'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rlwrap'
brew 'rtmpdump'
brew 'rubberband'
brew 'ruby'
brew 'ruby-build'
brew 'screen'
brew 'sdl2'
brew 'sfsexp'
brew 'shellcheck'
brew 'skaffold'
brew 'snap'
brew 'snapcraft'
brew 'snappy'
brew 'sops'
brew 'speex'
brew 'spirv-llvm-translator'
brew 'spirv-tools'
brew 'sponge'
brew 'sqlite'
brew 'squashfs'
brew 'srt'
brew 'subversion'
brew 'svt-av1'
brew 'swi-prolog'
brew 'talloc'
brew 'tbb'
brew 'tcl-tk'
brew 'tcl-tk@8'
brew 'tctl'
brew 'temporal'
brew 'terraform-docs'
brew 'terragrunt'
brew 'tesseract'
brew 'tfenv'
brew 'tflint'
brew 'theora'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tokyo-cabinet'
brew 'tree'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'unixodbc'
brew 'utf8proc'
brew 'velero'
brew 'vim'
brew 'virtualenv'
brew 'vnstat'
brew 'w3m'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'x264'
brew 'x265'
brew 'xapian'
brew 'xauth'
brew 'xcb-util'
brew 'xcb-util-image'
brew 'xcb-util-keysyms'
brew 'xcb-util-renderutil'
brew 'xcb-util-wm'
brew 'xdelta'
brew 'xdot'
brew 'xdotool'
brew 'xkbcomp'
brew 'xkeyboard-config'
brew 'xmlstarlet'
brew 'xorg-server'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'yq'
brew 'z'
brew 'z3'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zsh'
brew 'zsh-lovers'
brew 'zstd'

# Other Cask applications
cask '1password-cli'
cask 'alfred'
cask 'aws-vault'
cask 'balenaetcher'
cask 'bartender'
cask 'dash'
cask 'datagrip'
cask 'dropbox'
cask 'electron-fiddle'
cask 'evernote'
cask 'fantastical'
cask 'fing'
cask 'finicky'
cask 'font-consolas-for-powerline'
cask 'font-d2coding'
cask 'font-dashicons'
cask 'font-devicons'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fontawesome'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-simple-line-icons'
cask 'font-source-code-pro'
cask 'font-ubuntu'
cask 'franz'
cask 'gimp'
cask 'gitee'
cask 'github'
cask 'goland'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'gpg-suite'
cask 'haptickey'
cask 'insomnia'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'kap'
cask 'keycastr'
cask 'lens'
cask 'linkliar'
cask 'macfuse'
cask 'meetingbar'
cask 'mqtt-explorer'
cask 'murus'
cask 'ngrok'
cask 'postman'
cask 'pycharm'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'quicklook-json'
cask 'rapidapi'
cask 'remember-the-milk'
cask 'rubymine'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'telegram'
cask 'tunnelblick'
cask 'tuple'
cask 'vagrant'
cask 'vagrant-manager'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'whatsapp'
cask 'wireshark'
cask 'workspaces'
cask 'xquartz'
cask 'zeplin'

# App Store applications
mas 'Dashlane (6.2513.1)', id: 517914548
mas 'Galaxy (1.2.2)', id: 572868480
mas 'Keynote (14.4)', id: 409183694
mas 'Kindle (7.29)', id: 302584613
mas 'Magnet (3.0.6)', id: 441258766
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
mas '‎WhatsApp (25.9.72)', id: 310633997
