
# tap repositories and their packages

tap 'homebrew/core'
brew 'adns'
brew 'adwaita-icon-theme'
brew 'ansible'
brew 'ant'
brew 'apr'
brew 'apr-util'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'awslogs'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bdw-gc'
brew 'bfg'
brew 'boost'
brew 'cairo'
brew 'circleci'
brew 'cmake'
brew 'coreutils'
brew 'ctop'
brew 'dive'
brew 'exa'
brew 'exiftool'
brew 'expect'
brew 'fdupes'
brew 'fish'
brew 'fontconfig'
brew 'foremost'
brew 'freetype'
brew 'fribidi'
brew 'fswatch'
brew 'gawk'
brew 'gd'
brew 'gdb'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gettext'
brew 'gh'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'git-secret'
brew 'git-secrets'
brew 'glib'
brew 'gmime'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gpgme'
brew 'graphite2'
brew 'graphviz'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'helm'
brew 'hicolor-icon-theme'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'hugo'
brew 'icu4c'
brew 'iftop'
brew 'imapfilter'
brew 'jasper'
brew 'jpeg'
brew 'jq'
brew 'k9s'
brew 'kind'
brew 'kops'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'lazydocker'
brew 'lazygit'
brew 'libassuan'
brew 'libepoxy'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'libpng'
brew 'librsvg'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvterm'
brew 'libxml2'
brew 'libyaml'
brew 'libzip'
brew 'lmdb'
brew 'lua'
brew 'luajit'
brew 'luarocks'
brew 'lz4'
brew 'lzo'
brew 'm-cli'
brew 'mas'
brew 'maven'
brew 'mercurial'
brew 'mitmproxy'
brew 'mpfr'
brew 'msgpack'
brew 'mu'
brew 'ncurses'
brew 'neomutt'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'nmap'
brew 'node'
brew 'node@10'
brew 'notmuch'
brew 'npth'
brew 'offlineimap'
brew 'oniguruma'
brew 'openjdk'
brew 'openssl@1.1'
brew 'p11-kit'
brew 'p7zip'
brew 'packer'
brew 'pango'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pinentry'
brew 'pipenv'
brew 'pixman'
brew 'pkg-config'
brew 'protobuf'
brew 'py3cairo'
brew 'pygobject3'
brew 'python@3.8'
brew 'rbenv'
brew 'rbspy'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ruby'
brew 'ruby-build'
brew 'screen'
brew 'shellcheck'
brew 'skaffold'
brew 'sqlite'
brew 'subversion'
brew 'talloc'
brew 'tektoncd-cli'
brew 'terraform'
brew 'terraform-docs'
brew 'terragrunt'
brew 'tflint'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tokyo-cabinet'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'vault'
brew 'velero'
brew 'vim'
brew 'vnstat'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'xapian'
brew 'xdot'
brew 'xmlstarlet'
brew 'xz'
brew 'yarn'
brew 'yq'
brew 'z'
brew 'zlib'
brew 'zsh'
brew 'zsh-lovers'

tap 'homebrew/cask-fonts'
cask 'font-consolas-for-powerline'
cask 'font-d2coding'
cask 'font-dashicons'
cask 'font-devicons'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fontawesome'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-ionicons'
cask 'font-simple-line-icons'
cask 'font-source-code-pro'
cask 'font-source-han-noto-cjk'
cask 'font-ubuntu'

tap 'homebrew/cask-versions'
cask 'adoptopenjdk8'
cask 'docker-edge'
cask 'firefox-developer-edition'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'alfred'
cask 'balenaetcher'
cask 'bartender'
cask 'cakebrew'
cask 'cheatsheet'
cask 'cleanmymac'
cask 'dash'
cask 'dashlane'
cask 'datagrip'
cask 'dropbox'
cask 'electron-fiddle'
cask 'evernote'
cask 'fantastical'
cask 'flash-npapi'
cask 'flash-ppapi'
cask 'franz'
cask 'gitee'
cask 'github'
cask 'goland'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'google-drive-file-stream'
cask 'gpg-suite'
cask 'haptickey'
cask 'insomnia'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'java'
cask 'kap'
cask 'linkliar'
cask 'multipass'
cask 'murus'
cask 'ngrok'
cask 'onyx'
cask 'paw'
cask 'postman'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlstephen'
cask 'quicklook-json'
cask 'remember-the-milk'
cask 'rubymine'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'station'
cask 'sublime-text'
cask 'suspicious-package'
cask 'telegram'
cask 'tunnelblick'
cask 'tuple'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wireshark'
cask 'zeplin'
cask 'zoomus'

tap 'boz/repo'
brew 'kail'

tap 'buildpacks/tap'
brew 'pack'

tap 'buo/cask-upgrade'

tap 'derailed/k9s'

tap 'github/gh'

tap 'maxandersen/tap'
brew 'jbang'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'tektoncd/tools'

tap 'ubuntu/microk8s'
brew 'microk8s'

tap 'wata727/tflint'

# App Store applications
mas 'Evernote Web Clipper (1.0.7)', id: 1481669779
mas 'Grammarly for Safari (9.18)', id: 1462114288
mas 'iMovie (10.1.14)', id: 408981434
mas 'JustJoin (1.2)', id: 1514260034
mas 'Keynote (10.1)', id: 409183694
mas 'Kindle (1.29.0)', id: 405399194
mas 'Numbers (10.1)', id: 409203825
mas 'Pages (10.1)', id: 409201541
mas 'Pomodoro-Tracker (16.8.1)', id: 1396146802
mas 'TweetDeck (3.16.1)', id: 485812721
mas 'YubiKey Personalization Tool (3.1.24)', id: 638161122
