
# tap repositories and their packages

tap 'homebrew/core'
brew 'act'
brew 'adns'
brew 'adr-tools'
brew 'adwaita-icon-theme'
brew 'ansible'
brew 'ant'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argocd'
brew 'asciidoctor'
brew 'assimp'
brew 'atk'
brew 'autoconf'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'awscli'
brew 'awscli@1'
brew 'awslogs'
brew 'balena-cli'
brew 'bash'
brew 'bash-completion@2'
brew 'bat'
brew 'bazelisk'
brew 'bdw-gc'
brew 'berkeley-db'
brew 'bfg'
brew 'boost'
brew 'brew-pip'
brew 'brotli'
brew 'c-ares'
brew 'ca-certificates'
brew 'cairo'
brew 'circleci'
brew 'clusterctl'
brew 'cmake'
brew 'coreutils'
brew 'ctop'
brew 'curl'
brew 'dbus'
brew 'delve'
brew 'difftastic'
brew 'direnv'
brew 'dive'
brew 'docker'
brew 'double-conversion'
brew 'duf'
brew 'eksctl'
brew 'entr'
brew 'etcd'
brew 'exa'
brew 'exiftool'
brew 'expect'
brew 'fdupes'
brew 'fish'
brew 'fluxctl'
brew 'fontconfig'
brew 'foremost'
brew 'freetype'
brew 'fribidi'
brew 'fswatch'
brew 'fzf'
brew 'gawk'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'gdrive'
brew 'gettext'
brew 'gh'
brew 'giflib'
brew 'gimme'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'git-lfs'
brew 'git-secret'
brew 'git-secrets'
brew 'glib'
brew 'glow'
brew 'gmime'
brew 'gmp'
brew 'gnu-sed'
brew 'gnupg'
brew 'gnuplot'
brew 'gnutls'
brew 'go'
brew 'go-jira'
brew 'gobject-introspection'
brew 'goreleaser'
brew 'gotop'
brew 'gpgme'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'gsettings-desktop-schemas'
brew 'gtk+3'
brew 'gts'
brew 'guile'
brew 'harfbuzz'
brew 'helm'
brew 'helmfile'
brew 'hicolor-icon-theme'
brew 'highlight'
brew 'htop'
brew 'httpie'
brew 'httrack'
brew 'hub'
brew 'hugo'
brew 'hunspell'
brew 'icu4c'
brew 'iftop'
brew 'imapfilter'
brew 'imath'
brew 'iperf'
brew 'isl'
brew 'jasper'
brew 'jemalloc'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'k9s'
brew 'kind'
brew 'kops'
brew 'krew'
brew 'kubebuilder'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'kubeseal'
brew 'kubespy'
brew 'kustomize'
brew 'lazydocker'
brew 'lazygit'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libcbor'
brew 'libcerf'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'libmetalink'
brew 'libmng'
brew 'libmpc'
brew 'libnghttp2'
brew 'libpng'
brew 'libproxy'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libsodium'
brew 'libssh2'
brew 'libtasn1'
brew 'libtermkey'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvmaf'
brew 'libvterm'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxfixes'
brew 'libxi'
brew 'libxinerama'
brew 'libxkbcommon'
brew 'libxml2'
brew 'libxrender'
brew 'libxtst'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'lmdb'
brew 'lua'
brew 'luajit-openresty'
brew 'luarocks'
brew 'luv'
brew 'lxc'
brew 'lz4'
brew 'lzo'
brew 'm-cli'
brew 'm4'
brew 'macos-term-size'
brew 'make'
brew 'mas'
brew 'maven'
brew 'md4c'
brew 'mercurial'
brew 'mitmproxy'
brew 'mpdecimal'
brew 'mpfr'
brew 'msgpack'
brew 'mu'
brew 'mysql'
brew 'ncurses'
brew 'neomutt'
brew 'neovim'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'node'
brew 'node@14'
brew 'notmuch'
brew 'npth'
brew 'numpy'
brew 'octant'
brew 'offlineimap'
brew 'oniguruma'
brew 'openblas'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@11'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'p11-kit'
brew 'p7zip'
brew 'packer'
brew 'pandoc'
brew 'pango'
brew 'parallel'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pinentry'
brew 'pinentry-mac'
brew 'pipenv'
brew 'pixman'
brew 'pkg-config'
brew 'protobuf'
brew 'pstree'
brew 'py3cairo'
brew 'pyenv'
brew 'pygobject3'
brew 'python@3.10'
brew 'python@3.8'
brew 'python@3.9'
brew 'qpdf'
brew 'qt'
brew 'qt@5'
brew 'rbenv'
brew 'rbspy'
brew 'rclone'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'rtmpdump'
brew 'ruby'
brew 'ruby-build'
brew 'screen'
brew 'shellcheck'
brew 'six'
brew 'skaffold'
brew 'snap'
brew 'snapcraft'
brew 'sops'
brew 'sponge'
brew 'sqlite'
brew 'squashfs'
brew 'subversion'
brew 'talloc'
brew 'tcl-tk'
brew 'tctl'
brew 'tektoncd-cli'
brew 'terraform'
brew 'terraform-docs'
brew 'terragrunt'
brew 'tfenv'
brew 'tflint'
brew 'tig'
brew 'tldr'
brew 'tmux'
brew 'tokyo-cabinet'
brew 'tree-sitter'
brew 'unbound'
brew 'unibilium'
brew 'utf8proc'
brew 'vault'
brew 'velero'
brew 'vim'
brew 'vnstat'
brew 'w3m'
brew 'watch'
brew 'waypoint'
brew 'webp'
brew 'wget'
brew 'xapian'
brew 'xdelta'
brew 'xdot'
brew 'xdotool'
brew 'xkeyboardconfig'
brew 'xmlstarlet'
brew 'xorgproto'
brew 'xz'
brew 'yarn'
brew 'yq'
brew 'z'
brew 'zlib'
brew 'zsh'
brew 'zsh-lovers'
brew 'zstd'

tap 'homebrew/bundle'

tap 'homebrew/cask-fonts'
cask 'font-consolas-for-powerline'
cask 'font-d2coding'
cask 'font-dashicons'
cask 'font-devicons'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fontawesome'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-simple-line-icons'
cask 'font-source-code-pro'
cask 'font-ubuntu'

tap 'homebrew/cask-versions'
cask 'adoptopenjdk8'
cask 'docker-edge'
cask 'firefox-developer-edition'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'alfred'
cask 'aws-vault'
cask 'balenaetcher'
cask 'bartender'
cask 'cakebrew'
cask 'cheatsheet'
cask 'dash'
cask 'datagrip'
cask 'dropbox'
cask 'electron-fiddle'
cask 'evernote'
cask 'fantastical'
cask 'fing'
cask 'franz'
cask 'gimp'
cask 'gitee'
cask 'github'
cask 'goland'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'google-drive'
cask 'google-drive-file-stream'
cask 'gpg-suite'
cask 'haptickey'
cask 'insomnia'
cask 'intellij-idea'
cask 'istat-menus'
cask 'iterm2'
cask 'kap'
cask 'lens'
cask 'linkliar'
cask 'macfuse'
cask 'meetingbar'
cask 'mqtt-explorer'
cask 'multipass'
cask 'murus'
cask 'ngrok'
cask 'onyx'
cask 'paw'
cask 'postman'
cask 'pycharm'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlstephen'
cask 'quicklook-json'
cask 'remember-the-milk'
cask 'rubymine'
cask 'sequel-pro'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'suspicious-package'
cask 'telegram'
cask 'tunnelblick'
cask 'tuple'
cask 'vagrant'
cask 'vagrant-manager'
cask 'visual-studio-code'
cask 'vlc'
cask 'warp'
cask 'whatsapp'
cask 'wireshark'
cask 'xquartz'
cask 'zeplin'

tap 'boz/repo'
brew 'kail'

tap 'buildpacks/tap'
brew 'pack'

tap 'buo/cask-upgrade'

tap 'datadog/tap'
brew 'devkube'
brew 'docker-local-dev'
brew 'kubectl-analyse'
brew 'kubectl-iscale'
brew 'kubectl-multiexec'
brew 'kubectl-template'
brew 'latest-artifact'
brew 'latest-chart'
brew 'latest-datacenter-config'
brew 'latest-image'
brew 's22-checker'
brew 'sce'
brew 'to-prod'
brew 'to-staging'
brew 'trigger-ci'
cask 'ddev'
cask 'ddtool'
cask 'tctl-data-converter'
cask 'tctl-local-auth'
cask 'tctx'

tap 'derailed/k9s'

tap 'github/gh'

tap 'goreleaser/tap'

tap 'gromgit/fuse'
brew 'sshfs-mac'

tap 'hashicorp/tap'

tap 'helm/tap'
brew 'chart-releaser'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'maxandersen/tap'

tap 'muesli/tap'

tap 'norwoodj/tap'
brew 'helm-docs'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'tektoncd/tools'

tap 'thethingsnetwork/lorawan-stack'
brew 'ttn-lw-cli'

tap 'ubuntu/microk8s'
brew 'microk8s'

tap 'wata727/tflint'

tap 'weaveworks/tap'

# Other Cask applications
cask 'dashlane'

# App Store applications
mas 'GarageBand (10.4.6)', id: 682658836
mas 'iMovie (10.3.3)', id: 408981434
mas 'Keynote (12.1)', id: 409183694
mas 'Kindle (1.37.0)', id: 405399194
mas 'Magnet (2.9.0)', id: 441258766
mas 'Numbers (12.1)', id: 409203825
mas 'Pages (12.1)', id: 409201541
